Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services_for_people_with_disabilities/respite_care.html.txt.tmx
Source language: en
Languages: ga

source: Respite care may involve providing alternative family or institutional care for a person with a disability in order to enable the carer to take a short break, a holiday or a rest
ga: Is féidir soláthar cúraim mhalartaigh theaghlaigh nó insitiúidigh do dhuine le míchumas bheith bainteach leis an gcúram faoisimh, d’fhonn cur ar chumas cúramóra chun sos gairid, saoire nó scíth a ghlacadh

source: It can cover very short-term respite, for example, a carer for an evening, or a much longer arrangement for a holiday
ga: Is féidir le faoiseamh fhíor-ghearrthéarmach bheith i gceist leis, mar shampla, feighlí i gcomhair tráthnóna, nó socrú i bhfad níos faide i gcomhair saoire

source: Schemes of respite care are sometimes called 'Breakaway' or 'Friendship' schemes
ga: Tugtar scéimeanna ‘Éalaithe’ nó ‘Cairdis’ ar na scéimeanna cúraim fhaoisim ó thráth go chéile

source: Respite care or temporary care may be based in the community or in an institution
ga: Is féidir leis an gcúram faoisimh nó sealadach bheith bunaithe sa phobal nó in institiúid éigin

source: In practice, respite care is provided to a varying degree at a number of locations around the country – in some cases by your Health Service Executive (HSE) Area and in others by local or national voluntary organisations
ga: Is ag roinnt ionad ar fud na tíre a sholáthraítear cúram faoisimh de chineál éigin sa ghnáthchleactadh - ag do Limistéar Fheidhmeannacht na Seirbhíse Sláinte (FSS) i gcásanna áirithe agus ag eagrais deonacha náisiúnta áitiúla nó náisiúnta i gcásanna eile

source: Care is provided at a number of locations around the country for people with different disabilities
ga: Soláthraítear an cúram ag roinnt ionad ar fud na tíre do dhaoine le míchumais éagsúla

source: The person being cared for may be admitted to a HSE nursing home for a period of two weeks
ga: Is féidir an duine a bhfuiltear ag tabhairt cúraim dóibh a ghlacadh isteach i dteach altranais de chuid na FSS ar feadh tréimhse dhá sheachtain

source: Longer stays may be possible in some circumstances
ga: D’fhéadfaí faid níos faide a bheith infhéideartha faoi chúinsí áirithe

source: Respite care is organised through your public health nurse or family doctor (GP)
ga: Is féidir cúram faoisimh a eagrú trí d’altra sláinte poiblí nó trí do lia teaghlaigh (GP)

source: Alternative care with a family is sometimes available for children with disabilities, whereas institutional care is usually provided for older people
ga: Cuirtear cúram malartach ar fáil uaireanta do leanaí le míchumais, agus is cúram institiúideach a sholáthraítear do dhaoine scothaosta de ghnáth

source: Sometimes, summer camp arrangements can be made for children with disabilities
ga: Is féidir socruithe campa samhraidh a dhéanamh do leanaí le míchumais ó thráth go chéile

source: These are funded by local HSE Areas at no cost to individuals
ga: Is trí na Limistéir FSS áitiúla a chistítear iad siúd, gan aon chostas do dhaoine aonair

source: The Carer's Support Grant (formerly called the Respite Care Grant) is an annual cash payment made by the Department of Social Protection to certain carers for use as they wish
ga: Íocaíocht bhliantúil airgid thirim atá i nDeontas Tacaíochta Cúramóra (tugadh Deontas Cúram Faoisimh air seo roimhe seo) a dhéanann an Roinn Coimirce Sóisialaí le cúramóirí áirithe d’fhonn gur féidir leo a rogha úsáide a bhaint as

source: Apply to the Disability Services Manager in your Local Health Office and/or to a voluntary organisation that caters for people with the relevant disability
ga: Déan iarratas chuig an mBainisteoir Seirbhísí Míchumais i d’Oifig Sláinte Áitiúil agus/nó chuig eagras deonach a fhónann do dhaoine leis an míchumas ábhartha

source: The National Home-sharing and Short-breaks Network is an association of people and organisations engaged in using, promoting and providing host family based services for Irish citizens with intellectual disability, physical disability and autism
ga: Is comhlachas daoine agus eagras é an Líonra Comhroinnte Tí agus Saoire Gairide a phléann le húsáid, cothú agus soláthar seirbhísí bunaithe ar óst-teaghlaigh do shaoránaigh Éireannach le míchumas intleachtúil, colanda nó leis an uathachas
